# IsInside Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Face..::..IsInside Method
Face Class See Also
---
Indicates whether the specified point is within this face.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsInside(UV) | Indicates whether the specified point is within this face. |
| IsInside(UV, IntersectionResult%) | Indicates whether the specified point is within this face and outputs additional information about the point location. |

# See Also
Face Class
Face Members
Autodesk.Revit.DB Namespace